scenarios/GAS_API_Test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="GAS API Test Plan" enabled="true">
      <stringProp name="TestPlan.comments">GAS API Test Plan for individual endpoints testing</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.arguments" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="API_BASE_URL" elementType="Argument">
            <stringProp name="Argument.name">API_BASE_URL</stringProp>
            <stringProp name="Argument.value">https://ephemeral-protected.api.perf-test.cdp-int.defra.cloud/fg-gas-backend</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="X_API_KEY" elementType="Argument">
            <stringProp name="Argument.name">X_API_KEY</stringProp>
            <stringProp name="Argument.value">oKSnV0hKgSFhw46vklnMpD2cehp2WBHT</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="AUTHORIZATION_TOKEN" elementType="Argument">
            <stringProp name="Argument.name">AUTHORIZATION_TOKEN</stringProp>
            <stringProp name="Argument.value">24b8165f-dea5-417e-8216-d9350cdf0d5a</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="GAS API Thread Group">
        <intProp name="ThreadGroup.num_threads">10</intProp>
        <intProp name="ThreadGroup.ramp_time">5</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">1</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP Request Defaults" enabled="true">
          <stringProp name="HTTPSampler.domain">ephemeral-protected.api.perf-test.cdp-int.defra.cloud</stringProp>
          <stringProp name="HTTPSampler.port">443</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.path">/fg-gas-backend/</stringProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.implementation">HttpClient4</stringProp>
        </ConfigTestElement>
        <hashTree/>
        <Arguments guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
          <collectionProp name="Arguments.arguments">
            <elementProp name="AUTHORIZATION_TOKEN" elementType="Argument">
              <stringProp name="Argument.name">AUTHORIZATION_TOKEN</stringProp>
              <stringProp name="Argument.value">24b8165f-dea5-417e-8216-d9350cdf0d5a</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="X_API_KEY" elementType="Argument">
              <stringProp name="Argument.name">X_API_KEY</stringProp>
              <stringProp name="Argument.value">oKSnV0hKgSFhw46vklnMpD2cehp2WBHT</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="CASE_REF" elementType="Argument">
              <stringProp name="Argument.name">CASE_REF</stringProp>
              <stringProp name="Argument.value">case-ref-1763973575-1</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
          </collectionProp>
        </Arguments>
        <hashTree/>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">x-api-key</stringProp>
              <stringProp name="Header.value">${X_API_KEY}</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Accept</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Content-Type</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Accept-Encoding</stringProp>
              <stringProp name="Header.value">identity</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Authorization</stringProp>
              <stringProp name="Header.value">Bearer ${AUTHORIZATION_TOKEN}</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="1. Get Grants" enabled="true">
          <stringProp name="HTTPSampler.path">/fg-gas-backend/grants</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Response Assertion - Status Code 200" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49586">200</stringProp>
            </collectionProp>
            <stringProp name="Assertion.custom_message">Expected 200 response code for grants endpoint</stringProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">1</intProp>
          </ResponseAssertion>
          <hashTree/>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Content Type Assertion" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="-43840953">application/json</stringProp>
            </collectionProp>
            <stringProp name="Assertion.custom_message">Expected JSON content type</stringProp>
            <stringProp name="Assertion.test_field">Assertion.response_headers</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">2</intProp>
          </ResponseAssertion>
          <hashTree/>
          <UniformRandomTimer guiclass="UniformRandomTimerGui" testclass="UniformRandomTimer" testname="Think Time" enabled="true">
            <stringProp name="ConstantTimer.delay">2000</stringProp>
            <stringProp name="RandomTimer.range">1000</stringProp>
          </UniformRandomTimer>
          <hashTree/>
        </hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="2. Get FRPS Private Beta Grant" enabled="true">
          <stringProp name="HTTPSampler.path">/fg-gas-backend/grants/frps-private-beta</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Response Assertion - Status Code 200" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49586">200</stringProp>
            </collectionProp>
            <stringProp name="Assertion.custom_message">Expected 200 response code for FRPS private beta grant endpoint</stringProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">1</intProp>
          </ResponseAssertion>
          <hashTree/>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Content Type Assertion" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="-43840953">application/json</stringProp>
            </collectionProp>
            <stringProp name="Assertion.custom_message">Expected JSON content type</stringProp>
            <stringProp name="Assertion.test_field">Assertion.response_headers</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">2</intProp>
          </ResponseAssertion>
          <hashTree/>
          <UniformRandomTimer guiclass="UniformRandomTimerGui" testclass="UniformRandomTimer" testname="Think Time" enabled="true">
            <stringProp name="ConstantTimer.delay">2000</stringProp>
            <stringProp name="RandomTimer.range">1000</stringProp>
          </UniformRandomTimer>
          <hashTree/>
        </hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="3. Get FRPS Private Beta Applications" enabled="true">
          <stringProp name="HTTPSampler.path">/fg-gas-backend/grants/frps-private-beta</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Response Assertion - Status Code 200" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49586">200</stringProp>
            </collectionProp>
            <stringProp name="Assertion.custom_message">Expected 200 response code for FRPS private beta applications endpoint</stringProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">1</intProp>
          </ResponseAssertion>
          <hashTree/>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Content Type Assertion" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="-43840953">application/json</stringProp>
            </collectionProp>
            <stringProp name="Assertion.custom_message">Expected JSON content type</stringProp>
            <stringProp name="Assertion.test_field">Assertion.response_headers</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">2</intProp>
          </ResponseAssertion>
          <hashTree/>
          <UniformRandomTimer guiclass="UniformRandomTimerGui" testclass="UniformRandomTimer" testname="Think Time" enabled="true">
            <stringProp name="ConstantTimer.delay">2000</stringProp>
            <stringProp name="RandomTimer.range">1000</stringProp>
          </UniformRandomTimer>
          <hashTree/>
        </hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="4. Get Application Status" enabled="true">
          <stringProp name="HTTPSampler.path">/fg-gas-backend/grants/frps-private-beta/applications/${CASE_REF}/status</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Response Assertion - Status Code 200" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49586">200</stringProp>
            </collectionProp>
            <stringProp name="Assertion.custom_message">Expected 200 response code for application status endpoint</stringProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">1</intProp>
          </ResponseAssertion>
          <hashTree/>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Content Type Assertion" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="-43840953">application/json</stringProp>
            </collectionProp>
            <stringProp name="Assertion.custom_message">Expected JSON content type</stringProp>
            <stringProp name="Assertion.test_field">Assertion.response_headers</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">2</intProp>
          </ResponseAssertion>
          <hashTree/>
          <UniformRandomTimer guiclass="UniformRandomTimerGui" testclass="UniformRandomTimer" testname="Think Time" enabled="true">
            <stringProp name="ConstantTimer.delay">2000</stringProp>
            <stringProp name="RandomTimer.range">1000</stringProp>
          </UniformRandomTimer>
          <hashTree/>
        </hashTree>
        <UserParameters guiclass="UserParametersGui" testclass="UserParameters" testname="Generate Unique Grant Code" enabled="true">
          <collectionProp name="UserParameters.names">
            <stringProp name="3372707">GRANT_CODE</stringProp>
          </collectionProp>
          <collectionProp name="UserParameters.thread_values">
            <collectionProp name="690971706">
              <stringProp name="-1239269195">sample-grant-${__UUID()}</stringProp>
            </collectionProp>
          </collectionProp>
          <boolProp name="UserParameters.per_iteration">true</boolProp>
        </UserParameters>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="5. Create Grant" enabled="true">
          <stringProp name="HTTPSampler.path">/fg-gas-backend/grants</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
  &quot;code&quot;: &quot;${GRANT_CODE}&quot;,&#xd;
  &quot;description&quot;: &quot;Sample grant description&quot;,&#xd;
  &quot;startDate&quot;: &quot;2024-01-01T00:00:00.000Z&quot;,&#xd;
  &quot;questions&quot;: [&#xd;
    {&#xd;
      &quot;id&quot;: &quot;q1&quot;,&#xd;
      &quot;text&quot;: &quot;What is your farm size?&quot;,&#xd;
      &quot;type&quot;: &quot;text&quot;&#xd;
    }&#xd;
  ],&#xd;
  &quot;actions&quot;: [&#xd;
    {&#xd;
      &quot;name&quot;: &quot;submit&quot;,&#xd;
      &quot;method&quot;: &quot;POST&quot;,&#xd;
      &quot;url&quot;: &quot;https://external-service.com/submit&quot;&#xd;
    }&#xd;
  ],&#xd;
  &quot;phases&quot;: [&#xd;
    {&#xd;
      &quot;code&quot;: &quot;application-phase&quot;,&#xd;
      &quot;name&quot;: &quot;application&quot;,&#xd;
      &quot;startDate&quot;: &quot;2024-01-01T00:00:00.000Z&quot;,&#xd;
      &quot;endDate&quot;: &quot;2024-02-01T00:00:00.000Z&quot;,&#xd;
      &quot;stages&quot;: [&#xd;
        {&#xd;
          &quot;code&quot;: &quot;initial-review-stage&quot;,&#xd;
          &quot;name&quot;: &quot;initial-review&quot;,&#xd;
          &quot;description&quot;: &quot;Initial review of application&quot;,&#xd;
          &quot;statuses&quot;: [&#xd;
            { &quot;code&quot;: &quot;pending&quot;, &quot;name&quot;: &quot;Pending&quot; },&#xd;
            { &quot;code&quot;: &quot;approved&quot;, &quot;name&quot;: &quot;Approved&quot; },&#xd;
            { &quot;code&quot;: &quot;rejected&quot;, &quot;name&quot;: &quot;Rejected&quot; }&#xd;
          ]&#xd;
        }&#xd;
      ]&#xd;
    }&#xd;
  ],&#xd;
  &quot;metadata&quot;: {&#xd;
    &quot;createdBy&quot;: &quot;system&quot;,&#xd;
    &quot;status&quot;: &quot;draft&quot;,&#xd;
    &quot;description&quot;: &quot;Metadata for sample grant&quot;,&#xd;
    &quot;startDate&quot;: &quot;2024-01-01T00:00:00.000Z&quot;&#xd;
  }&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Response Assertion - Status Code 204" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49590">204</stringProp>
            </collectionProp>
            <stringProp name="Assertion.custom_message">Expected 204 response code for grant creation</stringProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">1</intProp>
          </ResponseAssertion>
          <hashTree/>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Content Type Assertion" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="-43840953">application/json</stringProp>
            </collectionProp>
            <stringProp name="Assertion.custom_message">Expected JSON content type</stringProp>
            <stringProp name="Assertion.test_field">Assertion.response_headers</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">2</intProp>
          </ResponseAssertion>
          <hashTree/>
          <RegexExtractor guiclass="RegexExtractorGui" testclass="RegexExtractor" testname="Extract Grant Code" enabled="true">
            <stringProp name="RegexExtractor.useHeaders">false</stringProp>
            <stringProp name="RegexExtractor.refname">CREATED_GRANT_CODE</stringProp>
            <stringProp name="RegexExtractor.regex">&quot;code&quot;:&quot;(sample-grant-[^&quot;]+)&quot;</stringProp>
            <stringProp name="RegexExtractor.template">$1$</stringProp>
            <stringProp name="RegexExtractor.default">NOT_FOUND</stringProp>
            <stringProp name="RegexExtractor.match_number">1</stringProp>
            <boolProp name="RegexExtractor.default_empty_value">false</boolProp>
          </RegexExtractor>
          <hashTree/>
          <UniformRandomTimer guiclass="UniformRandomTimerGui" testclass="UniformRandomTimer" testname="Think Time" enabled="true">
            <stringProp name="ConstantTimer.delay">2000</stringProp>
            <stringProp name="RandomTimer.range">1000</stringProp>
          </UniformRandomTimer>
          <hashTree/>
        </hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="6. Update Grant" enabled="true">
          <stringProp name="HTTPSampler.path">/fg-gas-backend/tmp/grants/${GRANT_CODE}</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">PUT</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
  &quot;description&quot;: &quot;Updated grant description&quot;,&#xd;
  &quot;startDate&quot;: &quot;2024-01-01T00:00:00.000Z&quot;,&#xd;
  &quot;questions&quot;: [&#xd;
    {&#xd;
      &quot;id&quot;: &quot;q1&quot;,&#xd;
      &quot;text&quot;: &quot;Updated question text?&quot;,&#xd;
      &quot;type&quot;: &quot;text&quot;&#xd;
    }&#xd;
  ],&#xd;
  &quot;actions&quot;: [&#xd;
    {&#xd;
      &quot;name&quot;: &quot;submit&quot;,&#xd;
      &quot;method&quot;: &quot;POST&quot;,&#xd;
      &quot;url&quot;: &quot;https://external-service.com/submit&quot;&#xd;
    }&#xd;
  ],&#xd;
  &quot;phases&quot;: [&#xd;
    {&#xd;
      &quot;code&quot;: &quot;application-phase&quot;,&#xd;
      &quot;name&quot;: &quot;application&quot;,&#xd;
      &quot;startDate&quot;: &quot;2024-01-01T00:00:00.000Z&quot;,&#xd;
      &quot;endDate&quot;: &quot;2024-02-01T00:00:00.000Z&quot;,&#xd;
      &quot;stages&quot;: [&#xd;
        {&#xd;
          &quot;code&quot;: &quot;initial-review-stage&quot;,&#xd;
          &quot;name&quot;: &quot;initial-review&quot;,&#xd;
          &quot;description&quot;: &quot;Initial review of application&quot;,&#xd;
          &quot;statuses&quot;: [&#xd;
            { &quot;code&quot;: &quot;pending&quot;, &quot;name&quot;: &quot;Pending&quot; },&#xd;
            { &quot;code&quot;: &quot;approved&quot;, &quot;name&quot;: &quot;Approved&quot; },&#xd;
            { &quot;code&quot;: &quot;rejected&quot;, &quot;name&quot;: &quot;Rejected&quot; }&#xd;
          ]&#xd;
        }&#xd;
      ]&#xd;
    }&#xd;
  ],&#xd;
  &quot;metadata&quot;: {&#xd;
    &quot;createdBy&quot;: &quot;system&quot;,&#xd;
    &quot;status&quot;: &quot;draft&quot;,&#xd;
    &quot;description&quot;: &quot;Metadata for updated grant&quot;,&#xd;
    &quot;startDate&quot;: &quot;2024-01-01T00:00:00.000Z&quot;&#xd;
  }&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Response Assertion - Status Code 204" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49590">204</stringProp>
            </collectionProp>
            <stringProp name="Assertion.custom_message">Expected 204 response code for grant update</stringProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">1</intProp>
          </ResponseAssertion>
          <hashTree/>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Content Type Assertion" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="-43840953">application/json</stringProp>
            </collectionProp>
            <stringProp name="Assertion.custom_message">Expected JSON content type</stringProp>
            <stringProp name="Assertion.test_field">Assertion.response_headers</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">2</intProp>
          </ResponseAssertion>
          <hashTree/>
          <UniformRandomTimer guiclass="UniformRandomTimerGui" testclass="UniformRandomTimer" testname="Think Time" enabled="true">
            <stringProp name="ConstantTimer.delay">2000</stringProp>
            <stringProp name="RandomTimer.range">1000</stringProp>
          </UniformRandomTimer>
          <hashTree/>
        </hashTree>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Aggregate Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="RespTimeGraphVisualizer" testclass="ResultCollector" testname="Response Time Graph" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <Summariser guiclass="SummariserGui" testclass="Summariser" testname="Generate Summary Results" enabled="true"/>
        <hashTree/>
        <ResultCollector guiclass="SimpleDataWriter" testclass="ResultCollector" testname="Simple Data Writer" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>